

#2) შექმენით სია, რომელიც თავდაპირველად იქნება ცარიელი შემდეგ კი ამ სიაში ჩაამატეთ 10 ელემენტი 
#3) შექმენით ორი სია ერთში თქვენი ხელით ჩაწერეთ ლუწი რიცხვები, მეორეში კენტი რიცხვები შემდეგ კი ეს ორი სია გააერთიანეთ extend ის გამოყენებით 
#4) შექმენით სია რომელშიც იქნება 20 ელემენტი, შემდეგ კი დაბეჭდეთ თითოეული სათითაოდ for loop ის გამოყენებით
#5) შექმენით რიცხვებით სავსე სია რომელშიც იქნება 1 დან 20 მდე ყველა რიცხვი, შემდეგ კი ამ სიიდან ამოშალეთ ყველა კენტი რიცხვი და დაამატეთ ახალ სიაში, ორივე სია დაბეჭდეთ
#6) შექმენით სია რომელშიც იქნება 10 განსხვავებული რიცხვი შემდეგ კი დაბეჭდეთ ყველა ლისტის ელემენტის ჯამი
#7) შექმენით რიცხვებით სავსე სია, გამოითვალეთ ამ სიის ელემენტების საშუალო არითმეტიკული
list1 = []
for i in range(10):
    list1.append(i + 1)
print("2) სია 10 ელემენტით:", list1)


even_list = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
odd_list = [1, 3, 5, 7, 9, 11, 13, 15, 17, 19]
even_list.extend(odd_list)
print("3) ლუწი და კენტი რიცხვების გაერთიანებული სია:", even_list)


list2 = list(range(1, 21))
print("4) სია 20 ელემენტით:")
for item in list2:
    print(item)

list3 = list(range(1, 21))
even_numbers = [x for x in list3 if x % 2 == 0]
odd_numbers = [x for x in list3 if x % 2 != 0]
print("5) კენტი რიცხვების სია:", odd_numbers)
print("5) ლუწი რიცხვების სია:", even_numbers)


list4 = [3, 5, 7, 9, 11, 13, 15, 17, 19, 21]
sum_list4 = sum(list4)
print("6) 10 განსხვავებული რიცხვის ჯამი:", sum_list4)


list5 = [3, 5, 7, 9, 11, 13, 15, 17, 19, 21]
average_list5 = sum(list5) / len(list5)
print("7) სიის საშუალო არითმეტიკული:", average_list5)
